<a href="https://colab.research.google.com/github/ralsouza/data_manipulation_with_python/blob/master/notebooks/05_pandas_dataframe_operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Operations with Dataframes

In [0]:
import pandas as pd
import numpy as np

## Part 1

In [0]:
olympic_medals_panel = {
    'USA' : {'Gold':46, 'Silver':37, 'Bronze':38},
    'China':{'Gold':26, 'Silver':18, 'Bronze':26},
    'Britain':{'Gold':27, 'Silver':23, 'Bronze':17},
    'Russe':{'Gold':19, 'Silver':18, 'Bronze':19},
    'Germany':{'Gold':17, 'Silver':10, 'Bronze':15}}

In [37]:
# Convert from dict to DataFrame
# We will use the .from_dict() because the olympic_medals_panel is a nested dict
olympiad = pd.DataFrame.from_dict(olympic_medals_panel); olympiad

        USA  China  Britain  Russe  Germany
Gold     46     26       27     19       17
Silver   37     18       23     18       10
Bronze   38     26       17     19       15

In [0]:
type(olympiad)

pandas.core.frame.DataFrame

In [0]:
# Making a subsetting by column name
medals_china = olympiad['China']; medals_china

Gold      26
Silver    18
Bronze    26
Name: China, dtype: int64

In [0]:
# The same could be done with "dot notation"
olympiad.China

Gold      26
Silver    18
Bronze    26
Name: China, dtype: int64

In [0]:
# Slice two columns
olympiad[['China','Russe']]

        China  Russe
Gold       26     19
Silver     18     18
Bronze     26     19

In [0]:
# Select with .get()
olympiad.get('Germany')

Gold      17
Silver    10
Bronze    15
Name: Germany, dtype: int64

In [0]:
# Selecting data using "Index Location" .iloc()
# Slice row, by row in index 1
olympiad.iloc[1]

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Silver, dtype: int64

## Part 2

In [11]:
# Print entire DataFrame
olympiad

        USA  China  Britain  Russe  Germany
Gold     46     26       27     19       17
Silver   37     18       23     18       10
Bronze   38     26       17     19       15

In [9]:
# All rows up to index 2 (exclusive)
olympiad[:2]

        USA  China  Britain  Russe  Germany
Gold     46     26       27     19       17
Silver   37     18       23     18       10

In [10]:
# All rows from index 2
olympiad[2:]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [12]:
# All rows jumping from two to two positions
olympiad[::2]

        USA  China  Britain  Russe  Germany
Gold     46     26       27     19       17
Bronze   38     26       17     19       15

In [14]:
# All rows in reverse order
olympiad[::-1]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15
Gold     46     26       27     19       17

In [15]:
# Could be...
olympiad[::-2]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15
Gold     46     26       27     19       17

# Slicing by Named Indexes with `.loc[]` function

In [16]:
# Return all columns with index Gold
olympiad.loc['Gold']

USA        46
China      26
Britain    27
Russe      19
Germany    17
Name: Gold, dtype: int64

In [19]:
# Return all rows from USA column
olympiad.loc[:,'USA']

Gold      46
Silver    37
Bronze    38
Name: USA, dtype: int64

In [20]:
# Return the value in China column and Silver row
olympiad.loc['Silver']['China']

18

In [21]:
# Return Silver row
olympiad.loc['Silver']

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Silver, dtype: int64

In [22]:
# Check if values in Gold column is more than 20
olympiad.loc['Gold'] > 20

USA         True
China       True
Britain     True
Russe      False
Germany    False
Name: Gold, dtype: bool

In [24]:
# Return all rows that column has more than 20 medals of Gold
olympiad.loc[:,olympiad.loc['Gold'] > 20]

        USA  China  Britain
Gold     46     26       27
Silver   37     18       23
Bronze   38     26       17

# Slicing by index with `.iloc` function
Is faster than `.loc()`

In [28]:
olympiad.iloc[:2]

        USA  China  Britain  Russe  Germany
Gold     46     26       27     19       17
Silver   37     18       23     18       10

In [27]:
olympiad.iloc[2,0:2]

USA      38
China    26
Name: Bronze, dtype: int64

In [30]:
olympiad.iloc[2:3,:]

        USA  China  Britain  Russe  Germany
Bronze   38     26       17     19       15

In [31]:
olympiad.iloc[1,:]

USA        37
China      18
Britain    23
Russe      18
Germany    10
Name: Silver, dtype: int64

In [33]:
olympiad.iloc[2,0]

38

# Remove a member in DataFrame

In [38]:
del olympiad['USA']; olympiad

        China  Britain  Russe  Germany
Gold       26       27     19       17
Silver     18       23     18       10
Bronze     26       17     19       15

# Insert a New Member

In [0]:
# .insert(index,columnName,(values))
olympiad.insert(0,'Brazil',(7,6,6))

In [40]:
olympiad

        Brazil  China  Britain  Russe  Germany
Gold         7     26       27     19       17
Silver       6     18       23     18       10
Bronze       6     26       17     19       15

# Resume of DataFrame

In [41]:
olympiad.describe()

         Brazil      China    Britain      Russe    Germany
count  3.000000   3.000000   3.000000   3.000000   3.000000
mean   6.333333  23.333333  22.333333  18.666667  14.000000
std    0.577350   4.618802   5.033223   0.577350   3.605551
min    6.000000  18.000000  17.000000  18.000000  10.000000
25%    6.000000  22.000000  20.000000  18.500000  12.500000
50%    6.000000  26.000000  23.000000  19.000000  15.000000
75%    6.500000  26.000000  25.000000  19.000000  16.000000
max    7.000000  26.000000  27.000000  19.000000  17.000000